{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "MiniCPMV",
    "parent_library": "transformers_modules.MiniCPM-V-2_6.modeling_minicpmv"
  },
  "base_model_name_or_path": "/data/fborazio/MiniCPM-V-2_6",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "embed_tokens",
    "resampler",
    "vpm"
  ],
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "llm\\..*layers\\.\\d+\\.self_attn\\.(q_proj|k_proj|v_proj|o_proj)",
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}